FI/Potilaan perustiedot/Integraatiopalvelu_Potilaanperustiedot_Esimerkkisanoma_UpdateNextOfKinData_Request_10.0.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.PatientDataIntegration" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.PatientDataIntegration.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:UpdateNextOfKinDataRequest>
         <!--Optional:-->
         <lif:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <lif1:MessageID>gero et</lif1:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:TransactionID>sonoras imperio</lif1:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:SenderID>quae divum incedo</lif1:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:SenderApplication>verrantque per auras</lif1:SenderApplication>
            <!--type: string-->
            <lif1:ReceiverID>per auras</lif1:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:ReceiverApplication>circum claustra</lif1:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <lif1:CharacterSet>nimborum in</lif1:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <lif1:DataServiceURL>foedere certo</lif1:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <lif1:UserLanguageCode>profundum quippe ferant</lif1:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <lif1:VersionNumber>et carcere</lif1:VersionNumber>
         </lif:MessageHeader>
         <!--Optional:-->
         <lif:Common>
            <!--Optional:-->
            <!--type: string-->
            <lif1:ContractKey>iovis rapidum iaculata</lif1:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <lif1:CallingSystem>speluncis abdidit</lif1:CallingSystem>
            <lif1:Area>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>bella gero et</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>flammas turbine</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>hoc metuens</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>ac vinclis</lif1:CodeDescription>
            </lif1:Area>
            <lif1:UserIdentifiers>
               <!--Zero or more repetitions:-->
               <lif1:UserIdentifier>
                  <!--type: UserIdentifierCodeId - enumeration: [SOCIAL_SECURITY_NUMBER,SV_CODE,TERHIKKI_CODE,EFFICA_USER_ID]-->
                  <lif1:UserIdentifierCodeId>TERHIKKI_CODE</lif1:UserIdentifierCodeId>
                  <!--type: string-->
                  <lif1:UserIdentifierCode>circum claustra</lif1:UserIdentifierCode>
                  <!--type: string-->
                  <lif1:FamilyName>coniunx una</lif1:FamilyName>
                  <!--type: string-->
                  <lif1:GivenNames>arce sceptra</lif1:GivenNames>
                  <!--type: string-->
                  <lif1:Profession>circum claustra fremunt</lif1:Profession>
               </lif1:UserIdentifier>
            </lif1:UserIdentifiers>
            <lif1:Function>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>certo et premere</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>et montis</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>feta furentibus</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>sed pater</lif1:CodeDescription>
            </lif1:Function>
            <!--Optional:-->
            <lif1:ReasonCode>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>talia flammato secum</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>austris aeoliam</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>sciret dare</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>dare iussus</lif1:CodeDescription>
            </lif1:ReasonCode>
         </lif:Common>
         <!--Optional:-->
         <lif:PatientId>
            <!--Optional:-->
            <!--type: string-->
            <lif2:Identifier>bella gero</lif2:Identifier>
         </lif:PatientId>
         <!--Optional:-->
         <lif:NextOfKinUpd>
            <!--Optional:-->
            <lif2:PatientId>
               <!--Optional:-->
               <!--type: string-->
               <lif2:Identifier>dedit qui foedere</lif2:Identifier>
            </lif2:PatientId>
            <!--Optional:-->
            <!--type: string-->
            <lif2:FamilyName>magno cum</lif2:FamilyName>
            <!--Optional:-->
            <!--type: string-->
            <lif2:GivenNames>ac terras</lif2:GivenNames>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:SecurityBan>false</lif2:SecurityBan>
            <!--Optional:-->
            <!--type: Relationship - enumeration: [UNDEFINED,UNKNOWN,FATHER,MOTHER,OTHER,CHILD,SPOUSE,SIBLING]-->
            <lif2:Relationship>UNKNOWN</lif2:Relationship>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:FosterParent>true</lif2:FosterParent>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:Guardian>true</lif2:Guardian>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:Dependant>true</lif2:Dependant>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:Partner>false</lif2:Partner>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:ContactPerson>true</lif2:ContactPerson>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:SupportPerson>false</lif2:SupportPerson>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:Trustee>true</lif2:Trustee>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:TrustedMan>true</lif2:TrustedMan>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:Primary>true</lif2:Primary>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:PatientAgent>true</lif2:PatientAgent>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:Payer>false</lif2:Payer>
            <!--Optional:-->
            <lif2:Language>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>in patriam</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>abdidit atris hoc</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>coniunx una cum</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>ipsa iovis</lif1:CodeDescription>
            </lif2:Language>
            <!--Optional:-->
            <lif2:Addresses>
               <!--Zero or more repetitions:-->
               <lif2:Address>
                  <!--type: AddressType - enumeration: [PERMANENT,TEMPORARY,OFFICE,BIRTHPLACE,UNKNOWN]-->
                  <lif2:AddressType>UNKNOWN</lif2:AddressType>
                  <!--Optional:-->
                  <!--type: string-->
                  <lif2:StreetAddress>aris imponet honorem</lif2:StreetAddress>
                  <!--Optional:-->
                  <!--type: string-->
                  <lif2:PostalCode>aris imponet</lif2:PostalCode>
                  <!--Optional:-->
                  <!--type: string-->
                  <lif2:City>premere et</lif2:City>
                  <!--Optional:-->
                  <!--type: string-->
                  <lif2:Country>insuper altos</lif2:Country>
                  <!--type: dateTime-->
                  <lif2:PeriodStart>2001-11-25T08:47:05+02:00</lif2:PeriodStart>
                  <!--type: dateTime-->
                  <lif2:PeriodEnd>2010-01-19T13:43:56</lif2:PeriodEnd>
                  <!--Optional:-->
                  <!--type: int-->
                  <lif2:Id>3</lif2:Id>
               </lif2:Address>
            </lif2:Addresses>
            <!--Optional:-->
            <lif2:Telephones>
               <!--Zero or more repetitions:-->
               <lif2:TeleAddress>
                  <!--type: TeleAddressType - enumeration: [EMAIL,MOBILE,PHONE,OFFICE,FAX]-->
                  <lif2:TeleAddressType>PHONE</lif2:TeleAddressType>
                  <!--Optional:-->
                  <!--type: string-->
                  <lif2:AddressValue>aris imponet</lif2:AddressValue>
                  <!--Optional:-->
                  <!--type: int-->
                  <lif2:Id>3</lif2:Id>
               </lif2:TeleAddress>
            </lif2:Telephones>
            <!--Optional:-->
            <!--type: boolean-->
            <lif2:PermissionForPatientData>true</lif2:PermissionForPatientData>
            <!--Optional:-->
            <!--type: string-->
            <lif2:Notes>tenens mollitque</lif2:Notes>
            <!--Optional:-->
            <!--type: NextOfKinAction - enumeration: [INS,UPD,DEL]-->
            <lif2:Action>INS</lif2:Action>
         </lif:NextOfKinUpd>
      </lif:UpdateNextOfKinDataRequest>
   </soapenv:Body>
</soapenv:Envelope>